import 'package:flutter/material.dart';

class Constants {
  static Color primaryColor = const Color(0xFFBC1729);
  static String aboutUsText =
      "–  это приложение, которое создано с целью помочь людям найти свою половинку и установить серьезные отношения. Приложение предлагает удобную и интуинтивно понятную платформу для знакомств, где пользователи могут искать людей по интересам и целям.";
  static List<String> servicesText = [
    "Пользователи могут создавать свой профиль, в котором указывают информацию о себе, свои интересы, предпочтения и фотографии",
    "Приложение предоставляет возможность общаться анонимно в чате, не раскрывая свою личность",
    "Функция поиска людей с определёнными интересами или параметрами в определённой географической местности",
    "Назначай или находи свидания, на которых ты не будешь знать, кто твой партнёр, пока не придёшь",
    "Создавай или находи встречи в любой точке мира с одним или несколькими пользователями",
  ];
  static List<String> searchCardText = [
    "После создания анкеты приложение начнёт предлагать вам кандидатов, которые соответствуют вашим критериям",
    "Если кто-то показал интерес к вашей анкете, вы получаете уведомление о возможности встрече и наоборот",
    "После взаимного интереса вы можете предложить свои контактные данные или общаться через бота",
    "При достаточном уровне уверенности друг в друге и желания, вы можете договориться о встрече в реальной жизни",
  ];
}
