class Constants {
  static const String imagePath = 'assets/images/';
  static const String iconPath = 'assets/icons/';
  static const List<String> interestName = [
    'Творчество',
    'Активный образ жизни',
    'Еда и напитки',
    'Социальная жизнь',
    'Домашние животные',
    'Спорт',
    'Время дома',
    'Путешествия',
    'Фильмы и сериалы',
    'Музыка',
  ];
  static const List<List<String>> interestNameList = [
    creativeWork,
    activeLifeStyle,
    foodsAndDrinks,
    socialLife,
    homePeds,
    sports,
    timeAtHome,
    travel,
    moviesAndSeries,
    musics,
  ];

  static const creativeWork = [
    '📷 Фотография',
    '📹 Видеосъемка',
    '👩‍💻 Дизайн',
    '💄 Макияж',
    '🧵 Рукоделие',
    '🕺 Танцы',
    '🎤 Вокал',
    '🎧 Музыка',
    '📝 Ведение блога',
    '🎨 Рисование',
  ];
  static const activeLifeStyle = [
    '🏃‍♀️ Бег',
    '💪 Фитнес',
    '🚴‍♂️ Велосипед',
    '🦓 Верховая езда',
    '🎿 Лыжи',
    '🧘‍♂️ Йога',
    '🤾 Пилатес',
    '🏂 Сноуборд',
    '🛼 Ролики',
    '🛹 Скейтборд',
    '🛴 Самокат',
  ];
  static const foodsAndDrinks = [
    '🍕 Пицца',
    '🍣 Суши',
    '🍔 Бургеры',
    '🥦 Здоровое питание',
    '🥒 Веганство',
    '🍏 Вегатарианство',
    '🥤 Кофе',
    '🫖 Чай',
    '🍪 Выпечка',
    '🍬 Сладости',
    '🥞 Домашняя кухня',
  ];
  static const socialLife = [
    '🏤 Кинотеатры',
    '🗽 Концерты',
    '🎑 Музеи',
    '🎭 Театры',
    '🏖 Отдых на природе',
    '🎡 Фестивали',
    '🥳 Тусовки и клубы',
    '🎅 Волонтерство',
    '🍴 Рестораны',
    '🛫 Путешествия',
    '👜 Шопинг',
    '🫂 Встречи с друзьями',
    '🖼 Искусство',
    '🧗 Активный отдых',
  ];
  static const homePeds = [
    '🐈‍⬛ Кошки',
    '🐕 Собаки',
    '🦜 Птицы',
    '🐡 Рыбки',
    '🐇 Кролики',
    '🐢 Черепахи',
    '🐍 Змеи',
    '🦎 Ящерицы',
    '🐹 Хомяки',
  ];
  static const sports = [
    '⚽️ Футбол',
    '🏊‍♂️ Плавание',
    '🚴 Велоспорт',
    '🏐 Волейбол',
    '🏒 Хоккей',
    '🏃‍♂️ Легкая атлетика',
    '🏋‍♀️ Тяжелая атлетика',
    '🥊 Бокс',
    '🛷 Фигурное катание',
    '🤸‍♀️ Гимнастика',
    '🎿 Лыжи',
    '🎮 Киберспорт',
  ];
  static const timeAtHome = [
    '🖥 Компьютерные игры',
    '🍝 Кулинария',
    '🎰 Настольные игры',
    '🎬 Кино и сериалы',
    '🌿 Садоводство',
    '👗 Мода и красота',
    '🤖 IT и технологии',
    '🚗 Автомобили',
  ];
  static const travel = [
    '🚅 Загородные поездки',
    '🏔 Горы',
    '🏕 Турпоходы',
    '🕌 Экскурсии',
    '🏖 Пляжный отдых',
    '🛳 Круизы',
    '🦖 Охота и рыбалка',
    '🪩 Мероприятия и концерты',
  ];
  static const moviesAndSeries = [
    '🤣 Комедии',
    '👶 Мультфильмы',
    '👩‍🚀 Исторические',
    '👮‍♀️ Детективы',
    '🧜‍♀️ Приключения',
    '🧛‍♀️ Ужасы',
    '😭 Драмы',
    '🥰 Мелодрамы',
    '👽 Триллеры',
    '🪖 Боевики',
  ];
  static const musics = [
    '😄 Инди',
    '🎼 Поп-музыка',
    '🤹‍♂️ Хип-хоп',
    '🎹 Электроника',
    '🎸 Рок',
    '🧑 Рэп',
    '🥁 Метал',
    '🎻 Классическая музыка',
    '💂‍♀️ Техно',
    '😏 Меломан',
  ];

  static const about1 = 'Мы находимся в уникальной эпохе, где технологии проникают во все сферы нашей жизни.Один страстный и креативный мозг был разработчиком в сфере программного обеспечения. Но, как и многие из нас, он столкнулся с вызовом в сфере личных отношений.';
  static const about2 = 'Обсуждая проблемы существующих приложений знакомств, мы выявили, что хотя технологии предоставляют огромные возможности для связи, они часто приводят к поверхностным взаимодействиям и утрате истинного смысла встреч.';
  static const about3 = 'Идея Mote не только решить эту проблему, но и внести новый, человеческий элемент в онлайн-знакомства. Мы решили создать приложение, которое учитывает не только интересы, но и эмоциональные нюансы. Их целью было сделать процесс знакомства более натуральным и приближенным к тому, как люди находят свою вторую половинку в реальной жизни.';
  static const about4 = 'Лозунг "Meet by Mote" несет в себе идею, что знакомства через приложение - это не просто обмен сообщениями, а создание настоящих связей с глубиной и смыслом.';
  static const about5 = 'Мы решили не останавливаться на достигнутом. Мы начали расширять функциональность Mote, добавляя возможности для организации мероприятий и встреч в реальной жизни. Это позволяло пользователям переходить от виртуального общения к реальным встречам, создавая более углубленные связи. \n\nТак Mote продолжает расти и эволюционировать, становясь не просто приложением для знакомств, а целым сообществом, объединенным желанием создать настоящие, значимые отношения в цифровом мире.';


  int countItems() {
    var sum = 0;
    for (var element in interestNameList) {
      sum += element.length;
    }
    return sum;
  }
}
